#### terraform plan every: 8e86b5b
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.cert.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:554506578892:certificate/edf0ecd3-c69b-4885-86d3-e74747cf8f50]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0b9c9dcab97f3491c]
module.route53.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:554506578892:certificate/f4430b4f-ea5c-46ad-9998-8c144d64f89b]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-0d33d8cfa7564e60c]
module.cert.aws_route53_record.validations["line-bot-sample2.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net._CNAME]
module.cert.aws_acm_certificate_validation.main: Refreshing state... [id=2021-05-13 15:20:13 +0000 UTC]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-074c62c425598a42d]
module.vpc.aws_subnet.privates[1]: Refreshing state... [id=subnet-0e5e70615e443fbd1]
module.vpc.aws_subnet.publics[1]: Refreshing state... [id=subnet-03f4cbdd4a64f5fcc]
module.vpc.aws_route_table.privates[0]: Refreshing state... [id=rtb-0cf0a00de04475799]
module.vpc.aws_route_table.privates[2]: Refreshing state... [id=rtb-0001d87961a570268]
module.vpc.aws_subnet.publics[2]: Refreshing state... [id=subnet-018065a63b6130bfe]
module.vpc.aws_route_table.privates[1]: Refreshing state... [id=rtb-06e85ec849b89819b]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-059083d65d7027ce5]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/line-bot-sample2-target-group/70b26b2b5f86c8c8]
module.vpc.aws_subnet.privates[0]: Refreshing state... [id=subnet-09b584e764d0f51ca]
module.vpc.aws_subnet.privates[2]: Refreshing state... [id=subnet-050f9b0e3625385e3]
module.vpc.aws_subnet.publics[0]: Refreshing state... [id=subnet-04804371ae1f9809c]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-074c62c425598a42d1080289494]
module.vpc.aws_route_table_association.privates[0]: Refreshing state... [id=rtbassoc-07fff2cedc144b0a2]
module.vpc.aws_route_table_association.privates[1]: Refreshing state... [id=rtbassoc-087ac8a98fd3c4f44]
module.vpc.aws_route_table_association.privates[2]: Refreshing state... [id=rtbassoc-080717701ab704511]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0565c85b8066041f2]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ec21ba1ee922076b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-037c6c791a364fa78]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/line-bot-sample2/9aa19f0481afc289]
module.alb.aws_lb_listener.http_to_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/9aa19f0481afc289/dc07c03b58d75d8e]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/9aa19f0481afc289/3aa5f65683cf4225]
module.alb.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener-rule/app/line-bot-sample2/9aa19f0481afc289/3aa5f65683cf4225/9196fa13b2f444dd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.alb.aws_lb.this will be updated in-place
  ~ resource "aws_lb" "this" {
        id                         = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/line-bot-sample2/9aa19f0481afc289"
        name                       = "line-bot-sample2"
      ~ security_groups            = [
          - "sg-0d33d8cfa7564e60c",
        ] -> (known after apply)
        tags                       = {}
        # (14 unchanged attributes hidden)


        # (4 unchanged blocks hidden)
    }

  # module.alb.aws_lb_listener.https will be updated in-place
  ~ resource "aws_lb_listener" "https" {
      ~ certificate_arn   = "arn:aws:acm:ap-northeast-1:554506578892:certificate/f4430b4f-ea5c-46ad-9998-8c144d64f89b" -> "arn:aws:acm:ap-northeast-1:554506578892:certificate/edf0ecd3-c69b-4885-86d3-e74747cf8f50"
        id                = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/9aa19f0481afc289/3aa5f65683cf4225"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.alb.aws_security_group.alb will be destroyed
  - resource "aws_security_group" "alb" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:554506578892:security-group/sg-0d33d8cfa7564e60c" -> null
      - description            = "alb" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0d33d8cfa7564e60c" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "line-bot-sample2-alb" -> null
      - owner_id               = "554506578892" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "line-bot-sample2-alb"
        } -> null
      - tags_all               = {
          - "Name" = "line-bot-sample2-alb"
        } -> null
      - vpc_id                 = "vpc-0b9c9dcab97f3491c" -> null
    }

  # module.route53.aws_acm_certificate.main will be destroyed
  - resource "aws_acm_certificate" "main" {
      - arn                       = "arn:aws:acm:ap-northeast-1:554506578892:certificate/f4430b4f-ea5c-46ad-9998-8c144d64f89b" -> null
      - domain_name               = "line-bot-sample2.moikilo00.net" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "line-bot-sample2.moikilo00.net"
              - resource_record_name  = "_9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_0d9444c4c345477db079eafb8e974446.bbfvkzsszw.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:ap-northeast-1:554506578892:certificate/f4430b4f-ea5c-46ad-9998-8c144d64f89b" -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [] -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.route53.aws_route53_record.main will be created
  + resource "aws_route53_record" "main" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "line-bot-sample2.moikilo00.net"
      + type            = "A"
      + zone_id         = "Z04052072YGY8CIREK2A2"

      + alias {
          + evaluate_target_health = true
          + name                   = "line-bot-sample2-1179553329.ap-northeast-1.elb.amazonaws.com"
          + zone_id                = "Z14GRHDCWA56QT"
        }
    }

  # module.security.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "alb"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "line-bot-sample2-alb-2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "line-bot-sample2-alb-2"
        }
      + tags_all               = {
          + "Name" = "line-bot-sample2-alb-2"
        }
      + vpc_id                 = "vpc-0b9c9dcab97f3491c"
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*